[
  {
    "subject": "COMP_ENG",
    "catalog_number": "203-0",
    "course_name": "Introduction to Computer Engineering",
    "description": "Overview of computer engineering design. Number systems and Boolean algebra. CMOS and logic gates. Design of combinational circuits and simplification. Decoders, multiplexers, adders. Sequential logic and flip flops. Introduction to assembly language.",
    "units": 1,
    "prereqs": []
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "205-0",
    "course_name": "Fundamentals of Computer System Software",
    "description": "Basics of assembly language programming. Macros. System stack and procedure calls. Techniques for writing assembly language programs. Features of Intel x86 architecture. Interfaces between C and assembly codes.",
    "units": 1,
    "prereqs": [
      "COMP_SCI 111-0",
      "GEN_ENG 205-1",
      "COMP_ENG 203-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "295-0",
    "course_name": "Special Topics in Computer Engineering",
    "description": "Topics suggested by students or faculty and approved by the department.",
    "units": 1,
    "prereqs": []
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "303-0",
    "course_name": "Advanced Digital Design",
    "description": "Overview of digital logic design. Technology review. Delays, timing in combinational and sequential circuits, CAD tools, arithmetic units such as ALUs and multipliers. Introduction to VHDL.",
    "units": 1,
    "prereqs": [
      "COMP_ENG 203-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "329-0",
    "course_name": "The Art of Multicore Concurrent Programming",
    "description": "Concurrency disciplines and practical programming techniques for multicore processors; synchronization primitives, mutual exclusion, foundation of shared memory, locking, non-blocking synchronization, and transactional memory.",
    "units": 1,
    "prereqs": [
      "COMP_SCI 110-0",
      "COMP_SCI 111-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "334-0",
    "course_name": "Fundamentals of Blockchains and Decentralization",
    "description": "This course is partly an introduction to the fundamentals of blockchains and decentralized applications and partly a springboard toward deeper understanding and further exploration. The course explains how blockchains work; teaches the underlying fundamentals of distributed consensus; provides hands-on experience through computer assignments; and also touches upon economic and policy issues.",
    "units": 1,
    "prereqs": [
      "COMP_SCI 212-0",
      "ELEC_ENG 302-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "346-0",
    "course_name": "Microcontroller System Design",
    "description": "Design of hardware and software systems built around microcontrollers. Standard peripherals such as GPIO, timers, and analog inputs. Communication interfaces such as UART, I2C, and SPI. Sensors and device driver design, including interrupts, DMA, and synchronous versus asynchronous design choices. Embedded software development. Hardware/software design tradeoffs.",
    "units": 1,
    "prereqs": [
      "COMP_SCI 211-0",
      "COMP_ENG 205-0",
      "COMP_SCI 213-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "347-1",
    "course_name": "Microprocessor Systems Project I",
    "description": "Design, prototype and test individual projects involving microprocessors and related devices such as PAL/FPGA and special purpose ICs. Embedded-system tools such as special purpose compilers and ICE (in-circuit emulation). Manufacturing issues such as PCB layout. Survey of microprocessor platforms. Part I deals with specification and design.",
    "units": 1,
    "prereqs": [
      "COMP_ENG 346-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "347-2",
    "course_name": "Microprocessor Systems Project II",
    "description": "Design, prototype and test individual projects involving microprocessors and related devices such as PAL/FPGA and special purpose ICs. Embedded-system tools such as special purpose compilers and ICE (in-circuit emulation). Manufacturing issues such as PCB layout. Survey of microprocessor platforms. Part II deals with implementation, testing, and documentation.",
    "units": 1,
    "prereqs": [
      "COMP_ENG 347-1"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "355-0",
    "course_name": "ASIC and FPGA Design",
    "description": "Overview of computer-aided design tool flow for ASIC and FPGA design. Synthesis from hardware description languages and creation of finite-state machines. Differences between FPGA and ASIC design flows. Exploration of concepts in several projects.",
    "units": 1,
    "prereqs": [
      "COMP_ENG 303-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "356-0",
    "course_name": "Introduction to Formal Specification & Verification",
    "description": "Introduction to formal techniques used for system specifications and verifications: temporal logic, set theory, proofs, and model checking. TLA+ (Temporal Logic of Actions) specifications. Safety and liveness properties. Real-time specs and verifications.",
    "units": 1,
    "prereqs": []
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "357-0",
    "course_name": "Design Automation in VLSI",
    "description": "VLSI physical design, including logic design, architectural design, and packaging. Development of CAD tools for VLSI physical design.",
    "units": 1,
    "prereqs": [
      "COMP_SCI 214-0",
      "COMP_ENG 303-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "358-0",
    "course_name": "Introduction to Parallel Computing",
    "description": "Introduction to parallel computing for scientists and engineers. Shared-memory parallel architectures and programming, distributed memory, message-passing data-parallel architectures, and programming.",
    "units": 1,
    "prereqs": [
      "COMP_SCI 211-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "361-0",
    "course_name": "Computer Architecture I",
    "description": "Design and understanding of the computer system as a whole unit. Performance evaluation and its role in computer system design; instruction set architecture design, data-path design and optimizations (e.g., ALU); control design; single cycle, multiple cycle, and pipeline implementations of processor. Hazard detection and forwarding; memory hierarchy design; cache memories, virtual memory, peripheral devices, and I/O.",
    "units": 1,
    "prereqs": [
      "COMP_ENG 205-0",
      "COMP_SCI 213-0",
      "COMP_ENG 303-0",
      "COMP_ENG 355-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "362-0",
    "course_name": "Computer Architecture Projects",
    "description": "Quarter-long team project designing a processor for a complete instruction set. Involves ISA design, design of components, data-path, and control for a pipelined processor to implement the ISA. Use of industrial-strength design tools and VHDL as the design specification language. Designs are evaluated using benchmark programs for correctness and performance.",
    "units": 1,
    "prereqs": [
      "COMP_ENG 361-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "364-0",
    "course_name": "CyberPhysical Systems Design and Application",
    "description": "This course will introduce trends and challenges of modern cyber-physical systems, and review state-of-the-art design paradigms and tools in academia and industry. It will introduce fundamental concepts in the modeling of cyber-physical systems, important models of computation such as dataflow, state machine, and synchronous-reactive semantics, real-time embedded architectures, and synthesis methodologies for generating efficient, correct, and predictable implementations.",
    "units": 1,
    "prereqs": []
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "365-0",
    "course_name": "Internet-of-things Sensors, Systems, And Applications",
    "description": "In-depth review of advanced technology surrounding the Internet-of-Things; including wireless sensing networks, wearables, drones, privacy, machine learning, and energy-efficient computing. Application domains in health, infrastructure monitoring, green computing and others are explored. Following a seminar format with alongside exploration of new research areas through a project proposal.",
    "units": 1,
    "prereqs": []
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "366-0",
    "course_name": "Embedded Systems",
    "description": "Introduction to the design and evaluation of embedded systems, with emphasis on the system-level aspects of embedded systems. Topics include modeling (models of computation and models of communication), survey of embedded system hardware, software and operating system issues specific to embedded system design, mapping specifications to hardware, and testing and evaluation of embedded systems.",
    "units": 1,
    "prereqs": []
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "368-0",
    "course_name": "Programming Massively Parallel Processors with CUDA",
    "description": "A hands-on introduction to parallel programming and optimizations for 1000+ core GPU processors, their architecture, the CUDA programming model, and performance analysis. Students implement various optimizations in massively-parallel workloads on modern GPUs. May not receive credit for both COMP_ENG 368-0 and COMP_ENG 468-0.",
    "units": 1,
    "prereqs": [
      "COMP_SCI 213-0",
      "COMP_SCI 211-0",
      "COMP_SCI 230-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "369-0",
    "course_name": "Introduction to Sensor Networks",
    "description": "Basic hardware and software platforms for sensor networks. Various algorithmic techniques for data routing, query processing, and tracking.",
    "units": 1,
    "prereqs": [
      "COMP_SCI 343-0",
      "COMP_SCI 340-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "387-0",
    "course_name": "Real-Time Digital Systems Design and Verification with FPGAs",
    "description": "This course covers the systematic design of real-time digital systems and verification techniques using field-programmable gate arrays (FPGAs) and presents a top-down design methodology where students learn how to translate software applications in high-level level languages (such as C/C++) into SystemVerilog models for FPGA architectures.",
    "units": 1,
    "prereqs": [
      "COMP_ENG 303-0",
      "COMP_ENG 355-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "391-0",
    "course_name": "CMOS VLSI Circuit Design",
    "description": "Design of modern CMOS very large-scale integrated (VLSI) circuits.",
    "units": 1,
    "prereqs": []
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "392-0",
    "course_name": "VLSI Systems Design Projects",
    "description": "Design of a cutting-edge VLSI chip. Teams of 5 to 10 students undertake a large circuit design problem, going from specification to VLSI implementation while optimizing for speed, area, and/or power. Group collaboration and engineering design.",
    "units": 1,
    "prereqs": [
      "COMP_ENG 391-0",
      "COMP_ENG 355-0"
    ]
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "393-0",
    "course_name": "Advanced Low Power VLSI and Mixed-signal IC Design",
    "description": "This course provides an in-depth review of the advanced technology in integrated circuit design. Special focuses will be given to ultra-low power circuit design, error resilient circuit design, machine learning accelerators, power management circuits and basic design of analog mixed-signal circuit. Following a seminar format, detailed case study on circuit design techniques used by Intel, IBM, etc. will be discussed.",
    "units": 1,
    "prereqs": []
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "395-0",
    "course_name": "Special Topics in Computer Engineering",
    "description": "Topics suggested by students or faculty and approved by the department.",
    "units": 1,
    "prereqs": []
  },
  {
    "subject": "COMP_ENG",
    "catalog_number": "399-0",
    "course_name": "Projects",
    "description": "Seminar and projects for advanced undergraduates on subjects of current interest in electrical and computer engineering.",
    "units": 1,
    "prereqs": []
  }
]